<template>
  <div>
    <Name v-for="(name, index) in names" :key="index" class="mb-2"/>
  </div>
</template>
<script>
export default {
  data() {
    return {
      names: [
        {
          name: "ນາງ ແມັກກີ້ ເພັດບຸນເຮືອງ",
          b: "1999-12-06",
          tel: "2055569634",
        },
        {
          name: "ນາງ ປາເຢັ້ງ ທ່າວ",
          b: "2003-03-10",
          tel: "2055412522",
        },
        {
          name: "ນາງ ປ່າເຢັງ ເຮີ",
          b: "1998-08-08",
          tel: "2057553072",
        },
        {
          name: "ນາງ ສຸກສະຫວັນ ກິ່ງສະດາ",
          b: "1997-10-13",
          tel: "2056035260",
        },
        {
          name: "ນາງ ໄມຄຳ ພົມມະລາດ",
          b: "1990-05-20",
          tel: "2022651243",
        },
        {
          name: "ນາງ ຕຸກຕາ ພູນປະສິດ",
          b: "2005-05-17",
          tel: "2054863415",
        },
        {
          name: "ນາງ ທັນນີ ປູ່ຄຳຕັນ",
          b: "1998-08-12",
          tel: "2054635404",
        },
        {
          name: "ນາງ ເນດ ",
          b: "2002-02-27",
          tel: "2054635404",
        },
        {
          name: "ນາງ ລິນ ເສນາວົງ",
          b: "2005-10-10",
          tel: "2054608161",
        },
        {
          name: "ທ້າວ ປ່າງອືວ່າງ ວ່າງ",
          b: "2006-06-09",
          tel: "2091643052",
        },
        {
          name: "ທ້າວ ສໍ ",
          b: "2001-08-05",
          tel: "2077071033",
        },
        {
          name: "ທ້າວ ສົມຫວັງ ພົມມະລາດ",
          b: "1993-07-11",
          tel: "2098125549",
        },
        {
          name: "ທ້າວ ພານິນ ອິນທະວົງສາ",
          b: "2002-10-22",
          tel: "30991969",
        },
        {
          name: "ທ້າວ ວັນທະວີສັກ ຊາມຸນຕຣີ",
          b: "2008-09-04",
          tel: "2055555162",
        },
        {
          name: "ທ້າວ ວັນທະວີໄຊ ຊາມຸນຕຣີ",
          b: "2011-07-27",
          tel: "2055954459",
        },
        {
          name: "ນາງ ເຢ້ ມົວ",
          b: "2002-07-05",
          tel: "2077392041",
        },
        {
          name: "ທ້າວ ຕຸ້ຍ ອຸ່ນມະໂມໄຊ",
          b: "1991-04-02",
          tel: "2098123212",
        },
        {
          name: "ນາງ ຂັນທອງ ແກ້ວດວງດີ",
          b: "1991-03-20",
          tel: "2056129987",
        },
        {
          name: "ນາງ ສົດ ",
          b: "1988-06-16",
          tel: "2098123315",
        },
      ],
    };
  },
};
</script>
