<template>
  <div>
    <div class="my-5">
      <v-row>
        <v-col cols="12" sm="6" md="3">
          <v-text-field
            v-model="interviewDate"
            dense
            hide-details="auto"
            label="ມື້ນັດ"
          ></v-text-field>
          <div class="grey--text">* ຕ້ອງປ້ອນປີເດືອນວັນ</div>
        </v-col>
      </v-row>
    </div>
    <Name
      v-for="(name, index) in names"
      :key="index"
      :item="name"
      :date="interviewDate"
      class="mb-2"
    />
  </div>
</template>
<script>
export default {
  data() {
    return {
      interviewDate: null,
      names: [
        {
          name: "ທ້າວ ອານັນດາ ໄຊຍະວົງ",
          b: "2002-03-27",
          tel: "2056111018",
        },
        {
          name: "ທ້າວ ສອນທະນູ ມູນລະມະນີ",
          b: "2014-07-24",
          tel: "2098030768",
        },
        {
          name: "ນາງ ຄຳປ໋ອກ ວິໄລພອນ",
          b: "1999-05-15",
          tel: "305677034",
        },
        {
          name: "ນາງ ສັນທະລາ ສີຄຳພອນ",
          b: "1989-08-03",
          tel: "2054785879",
        },
        {
          name: "ນາງ ຄຳຄູນ ຖາວອນ",
          b: "1999-02-02",
          tel: "2023235674",
        },
        {
          name: "ນາງ ຊົ່ງ ຢ່າງ",
          b: "2002-06-03",
          tel: "305196390",
        },
        {
          name: "ນາງ ເກດສຸດາ ອິນປະເສີດ",
          b: "1997-12-11",
          tel: "2093994592",
        },
        {
          name: "ນາງ ລຸນນີ ແສງອຸດທິຍະ",
          b: "2000-01-12",
          tel: "2076158641",
        },
        {
          name: "ນາງ ອຳໃຜ ທຳມະວົງສາ",
          b: "2005-08-12",
          tel: "309595872",
        },
        {
          name: "ນາງ ປຸ້ຍ ລັດຕະນະວົງ",
          b: "2000-09-18",
          tel: "2098813873",
        },
        {
          name: "ນາງ ແພມົນ ອິນທະໂຄດ",
          b: "2001-02-06",
          tel: "2097703569",
        },
        {
          name: "ນາງ ບຸນລັດ ມະນີວົງ",
          b: "2003-02-13",
          tel: "2096904586",
        },
        {
          name: "ນາງ ສີໄຄ ມະນີວົງ",
          b: "1989-03-25",
          tel: "2096904586",
        },
        {
          name: "ນາງ ຄອນສະຫວັນ ໄຊຍະເລີດ",
          b: "1993-01-01",
          tel: "2022196500",
        },
        {
          name: "ນາງ ຂົມ ສາງພະຈັນ",
          b: "2005-04-23",
          tel: "2098621543",
        },
        {
          name: "ນາງ ໂສພາ ໂຊກວິສັກ",
          b: "2004-07-24",
          tel: "2052894401",
        },
        {
          name: "ທ້າວ ທິນະກອນ ບໍລິບູນ",
          b: "2008-03-27",
          tel: "2055939129",
        },
        {
          name: "ທ້າວ ກໍ ທ່າວ",
          b: "1984-04-29",
          tel: "304503218",
        },
        {
          name: "ທ້າວ ພອນທິບ ມະນີວົງ",
          b: "2003-09-15",
          tel: "2096904586",
        },
        {
          name: "ທ້າວ ສັນຍາລັກ ສິງມີໄຊ",
          b: "2002-01-03",
          tel: "2055341950",
        },
        {
          name: "ທ້າວ ລາ ບານບົວທອງ",
          b: "1997-08-05",
          tel: "205772034",
        },
      ],
    };
  },
  mounted() {
    this.interviewDate = `${new Date().getFullYear()}-${
      new Date().getMonth() + 1
    }-${new Date().getDate()}`;
  },
};
</script>
